In [1]:
import pandas as pd

In [2]:
movies = pd.read_json("movies.json")
reviews = pd.read_json("reviews.json")
reviews.head()

   user_id  item_id  rating           timestamp
0        0       50       5 1997-12-04 15:55:49
1        0      172       5 1997-12-04 15:55:49
2        0      133       1 1997-12-04 15:55:49
3      196      242       3 1997-12-04 15:55:49
4      186      302       3 1998-04-04 19:22:22

In [3]:
reviews.drop(['timestamp'], inplace=True, axis=1)

In [4]:
reviews.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99710 entries, 0 to 99709
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   user_id  99710 non-null  int64
 1   item_id  99710 non-null  int64
 2   rating   99710 non-null  int64
dtypes: int64(3)
memory usage: 2.3 MB

In [5]:
mostReviewed = 3
topN = reviews.groupby('item_id').size()

In [6]:
topN = topN.sort_values(ascending=False).reset_index()[:mostReviewed]
topN

   item_id    0
0       50  583
1      258  507
2      100  506

In [7]:
top3DF = reviews[reviews['item_id'].isin(topN['item_id'])]

In [8]:
top3DF.head()

     user_id  item_id  rating
0          0       50       5
53       251      100       4
188       26      258       3
267       66      258       4
378      207      258       4

In [9]:
pivotDF = top3DF.pivot(index='user_id', columns='item_id', values='rating')

In [10]:
pivotDF = pivotDF.dropna(axis=0, how="all")

In [11]:
pivotDF = pivotDF.fillna(-1)

In [12]:
pivotDF.head()

item_id  50   100  258
user_id
0        5.0 -1.0 -1.0
1        5.0  5.0  5.0
2        5.0  5.0  3.0
3       -1.0 -1.0  2.0
4        5.0 -1.0  5.0

In [13]:
from sklearn.cluster import MeanShift

In [14]:
ms = MeanShift(bandwidth=2)

In [15]:
ms = ms.fit(pivotDF)

In [16]:
ms.labels_

array([4, 0, 0, 2, 3, 1, 0, 0, 3, 4, 1, 6, 4, 0, 1, 3, 5, 5, 1, 2, 4, 0,
       3, 0, 6, 3, 0, 1, 0, 3, 1, 2, 2, 4, 2, 2, 1, 4, 0, 0, 1, 1, 2, 4,
       7, 5, 4, 6, 0, 0, 4, 3, 0, 1, 0, 4, 2, 0, 0, 0, 0, 3, 3, 0, 4, 1,
       1, 5, 6, 5, 6, 1, 0, 1, 5, 1, 4, 0, 2, 1, 1, 6, 4, 0, 0, 4, 1, 1,
       0, 2, 4, 3, 4, 0, 2, 5, 2, 1, 0, 2, 2, 2, 0, 5, 1, 3, 3, 6, 0, 3,
       1, 1, 4, 3, 2, 3, 3, 2, 0, 5, 1, 2, 2, 2, 6, 4, 5, 5, 2, 0, 2, 0,
       0, 2, 2, 4, 2, 1, 0, 2, 3, 5, 0, 1, 2, 1, 1, 4, 2, 6, 2, 2, 6, 3,
       2, 2, 2, 1, 1, 0, 0, 0, 2, 2, 6, 1, 3, 0, 3, 5, 1, 1, 6, 0, 6, 1,
       6, 3, 3, 6, 3, 0, 2, 3, 2, 2, 2, 6, 3, 4, 0, 1, 3, 1, 2, 5, 2, 2,
       1, 0, 2, 2, 2, 1, 2, 1, 4, 1, 1, 0, 1, 1, 5, 2, 1, 0, 3, 1, 0, 1,
       0, 0, 0, 5, 1, 3, 6, 1, 0, 2, 2, 7, 0, 5, 7, 5, 1, 0, 1, 3, 0, 4,
       0, 3, 0, 0, 2, 1, 1, 2, 2, 1, 2, 7, 0, 1, 0, 4, 1, 1, 0, 0, 1, 0,
       0, 4, 1, 5, 0, 2, 0, 0, 7, 0, 1, 2, 3, 3, 1, 0, 5, 5, 1, 1, 1, 3,
       0, 3, 1, 4, 7, 0, 0, 1, 5, 3, 5, 0, 2, 1, 4, 5, 0, 4, 5, 0, 0, 0,
       1, 0, 5, 5, 3, 2, 1, 2, 0, 2, 2, 2, 4, 0, 0, 2, 0, 6, 0, 1, 4, 1,
       4, 5, 1, 1, 5, 6, 0, 1, 0, 1, 7, 5, 2, 5, 4, 0, 6, 1, 6, 0, 3, 3,
       4, 0, 5, 1, 1, 1, 2, 5, 0, 0, 2, 4, 1, 0, 2, 1, 2, 3, 0, 6, 2, 0,
       0, 2, 1, 5, 1, 0, 6, 7, 0, 1, 2, 0, 0, 0, 4, 0, 4, 1, 1, 5, 2, 5,
       5, 2, 0, 1, 0, 2, 5, 0, 2, 1, 0, 0, 0, 0, 0, 1, 3, 6, 3, 5, 0, 3,
       0, 3, 0, 0, 0, 4, 0, 0, 1, 1, 0, 0, 1, 3, 3, 3, 0, 0, 0, 2, 0, 6,
       5, 0, 1, 4, 4, 0, 0, 7, 0, 5, 2, 1, 0, 4, 3, 3, 4, 3, 2, 3, 3, 0,
       2, 4, 3, 5, 5, 0, 5, 3, 1, 5, 0, 1, 3, 2, 1, 5, 0, 0, 4, 0, 0, 3,
       0, 3, 1, 2, 3, 0, 2, 0, 0, 3, 7, 0, 1, 1, 0, 4, 5, 0, 7, 4, 4, 3,
       1, 5, 5, 0, 2, 5, 3, 6, 4, 1, 1, 2, 0, 0, 1, 0, 6, 3, 4, 2, 2, 5,
       5, 0, 1, 1, 0, 3, 4, 2, 4, 0, 4, 1, 5, 5, 0, 5, 5, 2, 4, 5, 3, 5,
       5, 2, 5, 1, 3, 4, 1, 1, 3, 0, 0, 2, 6, 2, 0, 0, 0, 4, 0, 6, 1, 1,
       5, 3, 3, 1, 0, 3, 2, 4, 4, 0, 0, 3, 0, 2, 1, 3, 1, 3, 1, 0, 1, 1,
       0, 3, 3, 3, 4, 2, 4, 2, 0, 1, 1, 1, 2, 0, 2, 1, 4, 3, 4, 5, 3, 1,
       4, 0, 0, 4, 1, 2, 0, 1, 4, 3, 5, 3, 4, 0, 3, 4, 3, 1, 4, 0, 4, 2,
       3, 5, 3, 2, 6, 0, 5, 0, 6, 4, 0, 4, 6, 0, 1, 2, 4, 0, 6, 4, 0, 4,
       0, 3, 0, 2, 1, 2, 4, 2, 0, 0, 0, 3, 3, 3, 0, 1, 4, 4, 5, 1, 2, 0,
       3, 2, 0, 4, 2, 4, 5, 3, 4, 0, 3, 2, 2, 4, 1, 2, 6, 1, 0, 4, 5, 1,
       1, 1, 0, 4, 3, 3, 4, 2, 1, 0, 0, 3, 2, 2, 5, 3, 2, 2, 2, 2, 2, 5,
       1, 0, 3, 2, 6, 1, 0, 3, 1, 0, 4, 2, 2, 0, 0, 1, 2, 2, 3, 0, 3, 3,
       4, 4, 3, 1, 2, 0, 2, 2, 5, 5, 0, 2, 0, 6, 3, 1, 1, 0, 3, 2, 2, 5,
       3, 2, 0, 4, 0, 1, 3, 1, 6, 1, 1, 1, 5, 0, 3, 1, 1, 3, 0, 1, 0, 4,
       2, 3, 5, 4, 3, 1, 6, 5, 0, 1, 1, 0, 2, 1, 1, 0, 2, 4, 3, 1, 0, 2,
       1, 1, 0, 5, 1, 1, 5, 0, 0, 0, 2, 0, 2, 3, 1], dtype=int64)

In [17]:
from sklearn.metrics import silhouette_score

In [18]:
ss = silhouette_score(pivotDF, ms.labels_)

In [ ]:
ss

In [19]:
scores = {}
for i in range(2, 10):
    ms = MeanShift(bandwidth=i)
    ms = ms.fit(pivotDF)
    if(len(set(ms.labels_)) > 1):
        ss = silhouette_score(pivotDF, ms.labels_)
        scores[i] = ss

In [ ]:
scores

In [ ]:
ms = MeanShift(bandwidth=3)
ms = ms.fit(pivotDF)

In [ ]:
pivotDF['Cluster'] = ms.labels_

In [ ]:
pivotDF.head()

In [ ]:
# Let's take a look at user #1! What movie should they watch next?
user1 = reviews[reviews['user_id'] == 1]

In [ ]:
user1

In [ ]:
user2 = reviews[reviews['user_id'] == 2]

In [ ]:
user2

In [ ]:
user1[user1['item_id'] == 302]

In [ ]:
movies[movies['item_id'] == 302]